tutorials/acoustics/gaussPulse/fluid/system/fvSchemes
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object fvSchemes;
}

ddtSchemes
{
  default bdf2;
}

gradSchemes
{
  default Gauss linear ;
}

divSchemes
{
  default Gauss linear ;
}

laplacianSchemes
{
  default Gauss linear corrected ;
}

interpolationSchemes
{
  default linear;
}

snGradSchemes
{
  default corrected;
}

fluxRequired
{
  default no;
  p /* empty */ ; 	/* empty */
  pcorr /* empty */ ; 	/* empty */
} 	// ************************************************************************* //

